***********************************************************************
*
* (c) Copyright IBM Corporation 2024.
*     Copyright Contributors to the GenevaERS Project.
* SPDX-License-Identifier: Apache-2.0
*
***********************************************************************
*
*   Licensed under the Apache License, Version 2.0 (the "License");
*   you may not use this file except in compliance with the License.
*   You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
*   Unless required by applicable law or agreed to in writing, software
*   distributed under the License is distributed on an "AS IS" BASIS,
*   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express
*   or implied.
*   See the License for the specific language governing permissions and
*   limitations under the License.
***********************************************************************
*
*   This module is called by the GvbJavaDaemon to wait on events
*   to communicate with assembler/3GL/etc code executing in separate
*   threads in the same address space, i.e. GVBMR95.
*
***********************************************************************
*
*        COMMUNICATIONS TENSOR TABLE DSECTS
*
CTTAREA  DSECT               ==TABLE HEADER
CTTEYE   DS    CL8
CTTACTR  DS    A               ADDR CTRAREA
CTTNUME  DS    H               NUMBER OF ENTRIES
CTTACTIV DS    X
         DS    X
CTTTECB  DS    F               TERMINATION ECB
CTTGECB  DS    F               GO ECB
CTTGECB2 DS    F               Acknowledge GO
         DS    XL4
CTTLEN   EQU   *-CTTAREA
*
*
CTRAREA  DSECT               ==TABLE ENTRY
CTRECB1  DS    F               ECB JAVA WORKER WAITS ON
CTRECB2  DS    F               ECB ASM  WORKER WAITS ON
CTRCSWRD DS    F               CS CONTROL WORD
CTRREQ   DS    CL4             REQUEST FUNCTION
CTRACLSS DS    D               ADDRESS OF CLASS FIELD (A32)
CTRAMETH DS    D               ADDRESS OF METHOD FIELD (A32)
CTRLENIN DS    D               LENGTH INPUT AREA 
CTRLENOUT DS   D               LENGTH OUTPUT AREA
CTRMEMIN DS    D               ADDR INPUT AREA
CTRMEMOUT DS   D               ADDR OUTPUT AREA
CTRTHRDN DS    H               Thread number
CTRJRETC DS    H               Provides exit return code to GVBMR95
CTRUR70W DS    XL4             Pointer to GVBUR70 workarea
         DS    XL8                                        
CTRLEN   EQU   *-CTRAREA
*
*
PARMSTR  DSECT                         Call control block
PAFUN    DS    CL8                     Function code
PAOPT    DS    CL8                     Option(s)
PATHREAD DS    CL10                    Name of Java thread
PAFLAG1  DS    X
PAFLAG2  DS    X
PASPARE  DS    XL52
PALEN1   DS    D                       Length of data sent from ASM
PALEN2   DS    D                       Length of data received by ASM
PAADDR1  DS    D                       Address of data sent
PAADDR2  DS    D                       Address of data received
PARETC   DS    D                       Return code
PAANCHR  DS    D                       Communications Tensor Table addr
PAATMEM  DS    D                       Thread local 31 bit storage
PAGENPA  DS    10D                     Genparm if called by GVBMR95
PARMLEN  EQU   *-PARMSTR
*
