*
*        CALL INTERFACE
*
UR70STR  DSECT
UR70FUN  DS    CL8
UR70OPNT DS   0H
UR70OPT  DS    CL8
UR70CLSS DS    CL32
UR70METH DS    CL32
UR70LSND DS    F
UR70LRCV DS    F
UR70LRET DS    F
UR70RETC DS    F
UR70ANCH DS    A
         DS    A
UR70LEN  EQU   *-UR70STR
*
