***********************************************************************
*
* (c) Copyright IBM Corporation 2023.
*     Copyright Contributors to the GenevaERS Project.
* SPDX-License-Identifier: Apache-2.0
*
***********************************************************************
*
*   Licensed under the Apache License, Version 2.0 (the "License");
*   you may not use this file except in compliance with the License.
*   You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
*   Unless required by applicable law or agreed to in writing, software
*   distributed under the License is distributed on an "AS IS" BASIS,
*   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express
*   or implied.
*   See the License for the specific language governing permissions and
*   limitations under the License.
***********************************************************************
*
*   This module is called by the GvbJavaDaemon to wait on events
*   to communicate with assembler/3GL/etc code executing in separate
*   threads in the same address space, i.e. GVBMR95.
*
***********************************************************************
*
*        GVBUR70 CALL INTERFACE
*
UR70STR  DSECT
UR70FUN  DS    CL8
UR70OPNT DS   0H
UR70OPT  DS    CL8
UR70CLSS DS    CL32
UR70METH DS    CL32
UR70LSND DS    F
UR70LRCV DS    F
UR70LRET DS    F
UR70RETC DS    F
UR70ANCH DS    A
         DS    A
UR70LEN  EQU   *-UR70STR
*
