//NCBUR70 JOB (ACCT),'BUILD MR95 GVBUR70',                            JOB22327
//            NOTIFY=&SYSUID.,
//            CLASS=A,
//            MSGLEVEL=(1,1),
//            TIME=(0,45),
//            MSGCLASS=X
//*
//         SET LVL1=GEBT
//         SET RTC=22964
//*
//****************************************************************
//*  ASSEMBLE MODULE -- WITH ASM PARMS FROM PM418052.B1298 BLDPMCO
//****************************************************************
//ASMP1    PROC
//ASM      EXEC PGM=ASMA90,
// PARM=(NODECK,OBJECT,ADATA,'SYSPARM(RELEASE)','OPTABLE(ZS7)',
// 'PC(GEN),FLAG(NOALIGN),SECTALGN(256),GOFF,LIST(133)')
//*
//SYSIN    DD DISP=SHR,DSN=NBEESLE.TEMPPEJV.ASM(&MEMBER)
//*
//SYSLIB   DD DISP=SHR,DSN=NBEESLE.TEMPPEJV.MAC
//         DD DISP=SHR,DSN=GEBT.LATEST.GVBMAC
//         DD DISP=SHR,DSN=ASM.SASMMAC2
//         DD DISP=SHR,DSN=SYS1.MACLIB
//         DD DISP=SHR,DSN=SYS1.MODGEN
//         DD DISP=SHR,DSN=CEE.SCEEMAC
//*
//SYSLIN   DD DSN=&LVL1..RTC&RTC..BTCHOBJ(&MEMBER),
//            DISP=SHR
//*
//SYSUT1   DD DSN=&&SYSUT1,
//            UNIT=SYSDA,
//            SPACE=(1024,(300,300),,,ROUND),
//            BUFNO=1
//*
//SYSADATA DD DISP=SHR,DSN=&LVL1..RTC&RTC..SYSADATA(&MEMBER)
//*
//SYSPRINT DD SYSOUT=*
//*YSPRINT DD DSN=&LVL1..RTC&RTC..LISTASM(&MEMBER),
//*           DISP=SHR
//*
//*       E X T R A C T   S T E P
//*
//EXTRACT  EXEC PGM=ASMLANGX,PARM='&MEMBER (ASM LOUD ERROR'
//* ARM='GVBXLEU (ASM LOUD ERROR'
//STEPLIB  DD   DISP=SHR,DSN=ASM.SASMMOD2
//SYSADATA DD   DISP=SHR,DSN=&LVL1..RTC&RTC..SYSADATA(&MEMBER)
//ASMLANGX DD   DISP=SHR,DSN=&LVL1..RTC&RTC..ASMLANGX
//*
//         PEND
//*
//*
//*
//ASMUR70  EXEC ASMP1,MEMBER=GVBUR70
//*ASMXRA   EXEC ASMP1,MEMBER=GVBXRA
//**ASMJWAIT EXEC ASMP1,MEMBER=GVBJWAIT
//**ASMJPOST EXEC ASMP1,MEMBER=GVBJPOST
//**ASMJMAIN EXEC ASMP1,MEMBER=GVBJMAIN
//**ASMJGO95 EXEC ASMP1,MEMBER=GVBJGO95
//*ASMMR96 EXEC ASMP1,MEMBER=GVBMR96
//*SMMRBS  EXEC ASMP1,MEMBER=GVBMRBS
//*SMMRVK  EXEC ASMP1,MEMBER=GVBMRVK
//*SMMRVS  EXEC ASMP1,MEMBER=GVBMRVS
//*SMSRCHR EXEC ASMP1,MEMBER=GVBSRCHR
//*SMUTMUE EXEC ASMP1,MEMBER=GVBUTMUE
//*SMUTMSG EXEC ASMP1,MEMBER=GVBUTMSG
//*SMXRCK  EXEC ASMP1,MEMBER=GVBXRCK
//*
